app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `role_id`, `remember_token`, `login`, `email`) VALUES('', '5ccf6aa8fd61f10de59707e7989dc5d258b77851', '2010-07-03 10:54:50', 'cd1415cdaba4f25d2f5a72f77c4a9efd9a2f2cdb', NULL, '2010-07-03 10:54:50', 1, NULL, 'ghufran', 'emghufran@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save